tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Command-line interface for SQLite
brew "sqlite"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# GNU binary tools for native development
brew "binutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# File comparison utilities
brew "diffutils"
# Classic UNIX line editor
brew "ed"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Apply a diff file to an original
brew "gpatch"
# GNU grep, egrep and fgrep
brew "grep"
# Popular GNU data compression program
brew "gzip"
# Improved top (interactive process viewer)
brew "htop"
# Pager program similar to more
brew "less"
# Utility for directing compilation
brew "make"
# Java-based project management
brew "maven"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Platform built on V8 to build network applications
brew "node"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Graphical network analyzer and capture tool
brew "wireshark"
# Allows connection to a computer remotely
cask "anydesk"
# Web security testing toolkit
cask "burp-suite"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Standalone Java Decompiler GUI
cask "jd-gui"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Penetration testing framework
cask "metasploit"
# Sandbox construction video game
cask "minecraft"
# Open-source code editor
cask "visual-studio-code"

brew "starship"
brew "fzf"
